bookstore_app/app/controllers/books_controller.rb

def index

@books=Book.all
---
SELECT `books`.* FROM `books`

def show

@book=Book.find(params[:id])
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1

def create



@book=Book.new(book_params)

@book.save
---
INSERT INTO `books` (`title`, `price`, `book_id`, `publisher`, `description`, `created_at`, `updated_at`) VALUES ('test', 3.0, '4', 'Me', 'erjopriohjvreo', '2019-01-28 15:45:37', '2019-01-28 15:45:37')